import dish_defs

dish_types_en = ['soups', 'garnish', 'meat', 'salad', 'drink']
dish_types_ru = ["супы", "гарниры", "мясо", "салаты", "напитки"]

dish_types = {k: v for k, v in zip(dish_types_en, dish_types_ru)}

soups = ["борщ", "суп лапша", "окрошка", "суп с чечевицей", "гороховый суп", "суп", "свекольник", "суп с пельменями",
         "солянка"]
garnish = ["картошка жареная", "картошка вареная", "картошка в мундире", "картошка фри", "макароны", "рис",
           "каша пшеничная", "пюре"]
meat = ["гуляш", "рыба тушеная", "отбивные", "котлеты", "селедка", "курица отварная", "мясо по французски",
        "мясо с овощами"]
salad = ["оливье", "мимоза", "весенний", "редис зеленью", "огурец", "помидор", "греческий", "селедка под шубой",
         "цезарь", "морковка с чесноком", "еврейский"]
drink = ["какао", "компот", "цикорий", "кофе", "чай", "кисель", "вода"]

dishes = {}

dish_vars = [soups, garnish, meat, salad, drink]

for i in dish_vars:
    dishes[dish_types_ru[dish_vars.index(i)]] = i

list_menu = {0: "Главное меню (м)", 1: "Получить меню (п)", 2: "Изменить меню (+)", 3: "Выйти (в)"}
print(list_menu[0])

dish_defs.file_write("dishes", dishes)

dish_defs.file_write("menu", list_menu)
